fist deployment log(SUCCESS)
```
[2023-01-25 15:13:52 +09:00]
Preparing deploy source at target commit (529d448918b56330078390db96df9e0955726532)
[2023-01-25 15:13:55 +09:00]
Successfully cloned the target commit
[2023-01-25 15:13:55 +09:00]
Successfully loaded the application configuration file
[2023-01-25 15:13:56 +09:00]
Successfully prepared deploy source at target commit (529d448918b56330078390db96df9e0955726532)
[2023-01-25 15:13:56 +09:00]
Using terraform version "Terraform v1.1.6 on linux_amd64 Your version of Terraform is out of date! The latest version is 1.3.7. You can update by downloading from https://www.terraform.io/downloads.html" to execute the terraform commands
[2023-01-25 15:13:56 +09:00]
terraform init
[2023-01-25 15:13:56 +09:00]
Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/google versions matching "3.61.0"...
[2023-01-25 15:13:56 +09:00]
- Installing hashicorp/google v3.61.0...
[2023-01-25 15:13:58 +09:00]
- Installed hashicorp/google v3.61.0 (signed by HashiCorp)
[2023-01-25 15:13:58 +09:00]
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.
[2023-01-25 15:13:58 +09:00]
[2023-01-25 15:13:58 +09:00]
Terraform has been successfully initialized!
[2023-01-25 15:13:58 +09:00]
You may now begin working with Terraform. Try running "terraform plan" to see any changes that are required for your infrastructure. All Terraform commands should now work. If you ever set or change modules or backend configuration for Terraform, rerun this command to reinitialize your working directory. If you forget, other commands will detect it and remind you to do so if necessary.
[2023-01-25 15:13:58 +09:00]
terraform plan -lock=false -detailed-exitcode
[2023-01-25 15:14:01 +09:00]
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:   + create

Terraform will perform the following actions:

[2023-01-25 15:14:01 +09:00]
  # google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "terraform-network-3"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
[2023-01-25 15:14:01 +09:00]
─────────────────────────────────────────────────────────────────────────────
[2023-01-25 15:14:01 +09:00]
Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
[2023-01-25 15:14:01 +09:00]
Detected 1 add, 0 change, 0 destroy. Those changes will be applied automatically.
[2023-01-25 15:14:01 +09:00]
terraform apply -auto-approve -input=false
[2023-01-25 15:14:04 +09:00]
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:   + create

Terraform will perform the following actions:

  # google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "terraform-network-3"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
[2023-01-25 15:14:05 +09:00]
google_compute_network.vpc_network: Creating...
[2023-01-25 15:14:15 +09:00]
google_compute_network.vpc_network: Still creating... [10s elapsed]
[2023-01-25 15:14:25 +09:00]
google_compute_network.vpc_network: Still creating... [20s elapsed]
[2023-01-25 15:14:35 +09:00]
google_compute_network.vpc_network: Still creating... [30s elapsed]
[2023-01-25 15:14:45 +09:00]
google_compute_network.vpc_network: Still creating... [40s elapsed]
[2023-01-25 15:14:49 +09:00]
google_compute_network.vpc_network: Creation complete after 43s [id=projects/pipecd/global/networks/terraform-network-3]
[2023-01-25 15:14:49 +09:00]
Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
[2023-01-25 15:14:49 +09:00]
Successfully applied changes
```

second deployment log(FAILURE)
```
[2023-01-25 15:19:22 +09:00]
Preparing deploy source at target commit (529d448918b56330078390db96df9e0955726532)
[2023-01-25 15:19:24 +09:00]
Successfully cloned the target commit
[2023-01-25 15:19:24 +09:00]
Successfully loaded the application configuration file
[2023-01-25 15:19:24 +09:00]
Successfully prepared deploy source at target commit (529d448918b56330078390db96df9e0955726532)
[2023-01-25 15:19:24 +09:00]
Using terraform version "Terraform v1.1.6 on linux_amd64 Your version of Terraform is out of date! The latest version is 1.3.7. You can update by downloading from https://www.terraform.io/downloads.html" to execute the terraform commands
[2023-01-25 15:19:24 +09:00]
terraform init
[2023-01-25 15:19:24 +09:00]
Initializing the backend...
[2023-01-25 15:19:24 +09:00]
Initializing provider plugins...
- Finding hashicorp/google versions matching "3.61.0"...
[2023-01-25 15:19:24 +09:00]
- Installing hashicorp/google v3.61.0...
[2023-01-25 15:19:27 +09:00]
- Installed hashicorp/google v3.61.0 (signed by HashiCorp)
[2023-01-25 15:19:27 +09:00]
[2023-01-25 15:19:27 +09:00]
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.
[2023-01-25 15:19:27 +09:00]
[2023-01-25 15:19:27 +09:00]
[2023-01-25 15:19:27 +09:00]
Terraform has been successfully initialized!
[2023-01-25 15:19:27 +09:00]
[2023-01-25 15:19:27 +09:00]
You may now begin working with Terraform. Try running "terraform plan" to see any changes that are required for your infrastructure. All Terraform commands should now work. If you ever set or change modules or backend configuration for Terraform, rerun this command to reinitialize your working directory. If you forget, other commands will detect it and remind you to do so if necessary.
[2023-01-25 15:19:27 +09:00]
[2023-01-25 15:19:27 +09:00]
terraform plan -lock=false -detailed-exitcode
[2023-01-25 15:19:29 +09:00]
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:   + create

Terraform will perform the following actions:

[2023-01-25 15:19:29 +09:00]
  # google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "terraform-network-3"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
[2023-01-25 15:19:29 +09:00]
Detected 1 add, 0 change, 0 destroy. Those changes will be applied automatically.
[2023-01-25 15:19:29 +09:00]
terraform apply -auto-approve -input=false
[2023-01-25 15:19:32 +09:00]
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:   + create

Terraform will perform the following actions:

  # google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "terraform-network-3"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
[2023-01-25 15:19:33 +09:00]
google_compute_network.vpc_network: Creating...
[2023-01-25 15:19:34 +09:00]
╷
│ Error: Error creating Network: googleapi: Error 409: The resource 'projects/pipecd/regions/asia-northeast1/subnetworks/terraform-network-3' already exists, alreadyExists
│ 
│   with google_compute_network.vpc_network,
│   on main.tf line 18, in resource "google_compute_network" "vpc_network":
│   18: resource "google_compute_network" "vpc_network" {
│ 
╵
[2023-01-25 15:19:34 +09:00]
Failed to apply changes (exit status 1)
```